doc/test_results/performance_mml.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10042

Document Path:          /mml
Document Length:        402 bytes

Concurrency Level:      8
Time taken for tests:   3.968 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      117400 bytes
Total body sent:        16700
HTML transferred:       40200 bytes
Requests per second:    25.20 [#/sec] (mean)
Time per request:       317.454 [ms] (mean)
Time per request:       39.682 [ms] (mean, across all concurrent requests)
Transfer rate:          28.89 [Kbytes/sec] received
                        4.11 kb/s sent
                        33.00 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   203  308  57.8    302     788
Waiting:      203  308  57.8    301     788
Total:        204  308  57.8    302     788

Percentage of the requests served within a certain time (ms)
  50%    302
  66%    307
  75%    309
  80%    315
  90%    322
  95%    333
  98%    490
  99%    788
 100%    788 (longest request)