doc/test_results/performance_png.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10042

Document Path:          /png
Document Length:        170 bytes

Concurrency Level:      8
Time taken for tests:   0.341 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      90600 bytes
Total body sent:        16700
HTML transferred:       17000 bytes
Requests per second:    293.21 [#/sec] (mean)
Time per request:       27.284 [ms] (mean)
Time per request:       3.411 [ms] (mean, across all concurrent requests)
Transfer rate:          259.42 [Kbytes/sec] received
                        47.82 kb/s sent
                        307.24 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    13   27   7.2     25      62
Waiting:       13   26   7.1     25      62
Total:         13   27   7.2     25      62

Percentage of the requests served within a certain time (ms)
  50%     25
  66%     27
  75%     28
  80%     28
  90%     31
  95%     39
  98%     59
  99%     62
 100%     62 (longest request)