doc/test_results/performance_svg.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10042

Document Path:          /svg
Document Length:        3724 bytes

Concurrency Level:      8
Time taken for tests:   3.987 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      448800 bytes
Total body sent:        16700
HTML transferred:       372400 bytes
Requests per second:    25.08 [#/sec] (mean)
Time per request:       318.929 [ms] (mean)
Time per request:       39.866 [ms] (mean, across all concurrent requests)
Transfer rate:          109.94 [Kbytes/sec] received
                        4.09 kb/s sent
                        114.03 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   181  313  48.1    305     566
Waiting:      181  312  48.1    304     565
Total:        181  313  48.1    305     566

Percentage of the requests served within a certain time (ms)
  50%    305
  66%    309
  75%    314
  80%    321
  90%    387
  95%    407
  98%    436
  99%    566
 100%    566 (longest request)