doc/test_results/performance_svg.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10042

Document Path:          /svg
Document Length:        3724 bytes

Concurrency Level:      8
Time taken for tests:   4.401 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      448800 bytes
Total body sent:        16700
HTML transferred:       372400 bytes
Requests per second:    22.72 [#/sec] (mean)
Time per request:       352.077 [ms] (mean)
Time per request:       44.010 [ms] (mean, across all concurrent requests)
Transfer rate:          99.59 [Kbytes/sec] received
                        3.71 kb/s sent
                        103.29 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   196  343  58.6    328     660
Waiting:      196  343  58.6    328     660
Total:        196  343  58.6    328     660

Percentage of the requests served within a certain time (ms)
  50%    328
  66%    342
  75%    349
  80%    385
  90%    419
  95%    454
  98%    475
  99%    660
 100%    660 (longest request)