doc/test_results/performance_texvcinfo.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10042

Document Path:          /texvcinfo
Document Length:        107 bytes

Concurrency Level:      8
Time taken for tests:   0.065 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      87300 bytes
Total body sent:        17300
HTML transferred:       10700 bytes
Requests per second:    1538.53 [#/sec] (mean)
Time per request:       5.200 [ms] (mean)
Time per request:       0.650 [ms] (mean, across all concurrent requests)
Transfer rate:          1311.66 [Kbytes/sec] received
                        259.93 kb/s sent
                        1571.59 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     2    5   3.1      4      16
Waiting:        2    5   2.9      4      16
Total:          2    5   3.2      4      16

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      5
  75%      7
  80%      7
  90%      9
  95%     12
  98%     16
  99%     16
 100%     16 (longest request)