doc/test_results/performance_texvcinfo.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            10042

Document Path:          /texvcinfo
Document Length:        79 bytes

Concurrency Level:      8
Time taken for tests:   0.115 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      84400 bytes
Total body sent:        17400
HTML transferred:       7900 bytes
Requests per second:    867.11 [#/sec] (mean)
Time per request:       9.226 [ms] (mean)
Time per request:       1.153 [ms] (mean, across all concurrent requests)
Transfer rate:          714.69 [Kbytes/sec] received
                        147.34 kb/s sent
                        862.03 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       3
Processing:     2    7   6.5      6      49
Waiting:        2    7   6.3      5      48
Total:          2    8   6.5      6      49

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      8
  75%      9
  80%      9
  90%     12
  95%     17
  98%     35
  99%     49
 100%     49 (longest request)